alex01277/rs485-esp/ESP8266_WS_V4.2/webserver.h
#ifndef WEBSERVER_H
#define WEBSERVER_H

#include <MD5Builder.h>
#include <FS.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include "detail/RequestHandlersImpl.h"

#include "config.h"
#include "cron.h"
#include "tools.h";

class http: public ESP8266WebServer {
  public:
    http(IPAddress addr, int port = 80): ESP8266WebServer(addr, port) {}
    http(int port = 80): ESP8266WebServer(port) { this->init(); }

    /* sys */
    void init();
    bool authorized();
    String codeTranslate(int code) { return ESP8266WebServer::responseCodeToString(code); }

    /* headers */
    void sendServerHeaders();

    /* handler */
    bool fsHandler(String path);

    /* api */
    void api_sensors();
    void api_sensors_structure();
    void api_sensors_log();
    void api_settings();
    void api_settings_gpio();
    void api_spiffs_upload();
    void api_spiffs_upload_handler();
    void api_spiffs_list();
    void api_spiffs_delete();
    void api_system_info();
    void api_system_reboot();
    void api_system_hardReset();
    void api_system_i2c_scaner();
    void api_system_update();
    void api_system_update_handler();

    String getContentType(String);
    
    /* api вспомогательные */
    String api_system_info_live(String);

    /* hash */
    String md5(String str);

    /* cookies */
    String cookiesKey  = this->md5(this->_getRandomHexString());
    String cookiesName = String(ESP.getChipId());

    /* secure */
    byte securityLevel = 0;
    byte securityFail  = 3;
    typedef enum { down = 0, up } security_t;
    bool security();
    void security(security_t action);
    
  private:
    #define headerJson F("application/json; charset=utf-8")
} http;

/*
   Инициализация web сервера микроконтроллера
*/
void http::init() {
  const char *headerkeys[] = {"User-Agent", "Cookie", "Accept-Encoding", "If-None-Match"};
  this->collectHeaders(headerkeys, sizeof(headerkeys) / sizeof(char*));

  this->on("/api/sensors",           HTTP_GET,  [this](){ api_sensors(); });
  this->on("/api/sensors/structure", HTTP_GET,  [this](){ api_sensors_structure(); });
  this->on("/api/sensors/log",       HTTP_GET,  [this](){ api_sensors_log(); });
  this->on("/api/settings",          HTTP_POST, [this](){ api_settings(); });
  this->on("/api/settings/gpio",     HTTP_GET,  [this](){ api_settings_gpio(); });
  this->on("/api/spiffs",            HTTP_POST, [this](){ api_spiffs_upload(); }, [this](){ api_spiffs_upload_handler(); });
  this->on("/api/spiffs",            HTTP_GET,  [this](){ api_spiffs_list(); });
  this->on("/api/spiffs/delete",     HTTP_POST, [this](){ api_spiffs_delete(); });
  this->on("/api/system/info",       HTTP_POST, [this](){ api_system_info(); });
  this->on("/api/system/reboot",     HTTP_POST, [this](){ api_system_reboot(); });
  this->on("/api/system/hardReset",  HTTP_POST, [this](){ api_system_hardReset(); });
  this->on("/api/system/i2c",        HTTP_GET,  [this](){ api_system_i2c_scaner(); });
  this->on("/api/system/update",     HTTP_POST, [this](){ api_system_update(); }, [this](){ api_system_update_handler(); });
  
  this->onNotFound([this](){ 
    this->sendServerHeaders();
    if(!this->fsHandler(this->uri())) this->send(404);
  });
  this->begin();
  
  /* задача для планировщика - плавный сброс ограничений доступа к панели управления */
  cron.add(cron::time_1m, [this](){ security(down); }, "httpSecurity");
}

/*
   Функция отвечает за авторизацию пользователя с использованием cookie и формы авторизации.
   Set-Cookie: NAME=VALUE; expires=DATE; path=PATH; domain=DOMAIN_NAME; secure
   https://ru.wikipedia.org/wiki/HTTP_cookie
*/
bool http::authorized() {
  /* проверка блокировки системы авторизации */
  if (!this->security()) return false;
  
  /* блок проверки агента */
  if (!this->hasHeader("User-Agent")) return false;
  if (!this->header("User-Agent").length()) return false;
  
  /* form (форма обязательно перед cookies - фикс бага с постоянной ошибкой авторизации при отказе удаления cookie) */  
  if (this->hasArg(F("login")) and this->hasArg(F("password"))) {
    if (this->arg(F("login")) == (conf.param("admin_login").length() ? conf.param("admin_login") : F("admin")) and
        this->arg(F("password")) == (conf.param("admin_pass").length() ? conf.param("admin_pass") : F("admin"))) {
      String clientKey = md5(this->_getRandomHexString());
      this->cookiesKey = md5(this->client().remoteIP().toString() + clientKey + this->header("User-Agent"));
      this->sendHeader("Set-Cookie", this->cookiesName + "=" + clientKey + "; path=/; HTTPonly");
      return true;
    }
    /* поднимаем уровень тревоги (подбор пароля через форму авторизации) */
    this->security(up);
    return false;
  }

  /* cookies (не допускайте переход к проверке cookies следом после проверки формы авторизации) */
  if (this->hasHeader("Cookie")) {
    unsigned int start;
    if ((start = this->header("Cookie").indexOf(this->cookiesName)) != -1) {
      start = start + this->cookiesName.length() + 1;
      String cookie = this->header("Cookie").substring(start, start + 32);
      if (md5(this->client().remoteIP().toString() + cookie + this->header("User-Agent")) == this->cookiesKey) return true;
      /* поднимаем уровень тревоги (подбор cookies) */
      this->security(up);
      this->sendHeader("Set-Cookie", this->cookiesName + "=; path=/; expires=Thu, 01 Jan 1970 00:00:00 GMT");
    }
  } return false;
}

String http::getContentType(String path) {
  if (path.endsWith(".html"))       return u8"text/html";
  else if (path.endsWith(".htm"))   return u8"text/html";
  else if (path.endsWith(".css"))   return u8"text/css";
  else if (path.endsWith(".json"))  return u8"application/json";
  else if (path.endsWith(".js"))    return u8"application/javascript";
  else if (path.endsWith(".png"))   return u8"image/png";
  else if (path.endsWith(".gif"))   return u8"image/gif";
  else if (path.endsWith(".jpg"))   return u8"image/jpeg";
  else if (path.endsWith(".ico"))   return u8"image/x-icon";
  else if (path.endsWith(".svg"))   return u8"image/svg+xml";
  else if (path.endsWith(".eot"))   return u8"font/eot"; 
  else if (path.endsWith(".woff"))  return u8"font/woff";
  else if (path.endsWith(".woff2")) return u8"font/woff2";
  else if (path.endsWith(".ttf"))   return u8"font/ttf";
  else if (path.endsWith(".xml"))   return u8"text/xml";
  else if (path.endsWith(".pdf"))   return u8"application/pdf";
  else if (path.endsWith(".zip"))   return u8"application/zip";
  else if (path.endsWith(".gz"))    return u8"application/x-gzip";
  else return u8"text/plain";
}

