alex01277/rs485-esp/ESP8266_WS_V4.2/webserver.h
/*
   Функция вызывается в случае отсутствия заранее определенного поведения при событии http::on()
   В таком случае предполагается, что клиент запрашивает файл, находящийся во flash памяти.
   Функция возвращает true в случае обнаружения файла и false в случае неудачи.
   Нельзя допустить передачи файлов конфигурации клиенту иначе это приведет к очень печальным последствиям.
   Производится поиск как оригинального файла, так и его архивной gzip копии, последняя имеет приоритет для отправки клиенту.
   Поддерживается система кэширования ETag и если у клиента будет найдена актуальная копия файла, передача не состоится, а
   клиент получит соответствующий заголовок, инициализирующий использование клиентом кэше.
*/
bool http::fsHandler(String path) {
  if (path != conf.fileName()) {
    if (path.endsWith(F("/"))) path = F("/index.htm");
    String contentType = this->getContentType(path);
    
    /* Поддерживает ли клиент сжатие данных и имеется ли у нас необходимый файл в gzip? */
    if (this->hasHeader(F("Accept-Encoding")) and contentType != F("application/x-gzip") and contentType != F("application/octet-stream")) {
      if (this->header(F("Accept-Encoding")).indexOf(F("gzip")) != -1 and SPIFFS.exists(path + F(".gz"))) {
        this->sendHeader(F("Content-Encoding"), F("gzip"));
        path += F(".gz");
      } else if (!SPIFFS.exists(path)) return false;
    } else if (!SPIFFS.exists(path)) return false;

    File file = SPIFFS.open(path, "r");
    size_t size = file.size();
    #ifdef console
      console.printf("http: %s %s, ", this->client().remoteIP().toString().c_str(), path.c_str());
    #endif
    /* Имеется ли у клиента в кэше актуальная версия файла? */
    if (this->hasHeader(F("If-None-Match"))) {
      if (this->header(F("If-None-Match")) == String(size)) {
        this->send(304);
        file.close();
        #ifdef console
          console.println(F("304"));
        #endif
        return true;
      }
    }

    /* Не повезло, клиент пуст. Начинаем перекачивать файл. */
    #ifdef console
      console.println(F("200"));
    #endif
    this->sendHeader(F("ETag"), String(size));
    this->setContentLength(size);
    this->send(200, contentType, "");
    this->client().write(file, 2920);
    file.close();

    return true;
  } return false;
}

/*
   Формирование списка заголовков.
   Без заголовка Origin невозможна отладка web интерфейса на локальной машине без загрузки файлов во flash память.
*/
void http::sendServerHeaders() {
  //this->sendHeader(F("Access-Control-Allow-Origin"), F("*"));
  //this->sendHeader(F("Access-Control-Allow-Credentials"), F("true"));
  this->sendHeader(F("Server"), F("sw: www.it4it.club, hw: esp8266"));
}

/*
   Предоставляет последние актуальные данные с сенсоров.
*/
void http::api_sensors() {
  this->sendServerHeaders();
  this->send(200, headerJson, this->api_system_info_live(sensors.get(false)));
}

/*
   Предоставляет информацию о структуре дерева сенсоров.
*/
void http::api_sensors_structure() {
  this->sendServerHeaders();
  this->send(200, headerJson, sensors.list());
}

/*
   Предоставляет лог по всем инициализированным сенсорам.
*/
void http::api_sensors_log() {
  this->sendServerHeaders();
  String answer = this->hasArg("sensor") ? sensors.log(this->arg("sensor").c_str()) : sensors.log();
  this->send(200, headerJson, answer);
}

/*
   Формирует безопасный список настроек для предоставления в web интерфейс.
*/
void http::api_settings() {
  this->sendServerHeaders();
  this->sendHeader("Cache-Control", "no-store, no-cache");
  if (!this->security()) this->send(403);
  else if (this->authorized()) {
    if (this->hasArg(F("save"))) conf.write(this->arg(F("save")));
    this->send(200, headerJson, conf.showSecureConfig());
  } else this->send(401);
}

/*
   Список текущих настроек для GPIO.
*/
void http::api_settings_gpio() {
  this->sendServerHeaders();
  if (this->authorized()) {
    String answer;
    answer += "\"gpio12\":" + conf.param("gpio12") + ",";
    answer += "\"gpio13\":" + conf.param("gpio13");
    this->send(200, headerJson, "{" + answer + "}");
  } else this->send(401);
}

/*
   Загрузка файлов во flash память микроконтроллера.
*/
void http::api_spiffs_upload() { /* объеденено с обработчиком */ }
void http::api_spiffs_upload_handler() {
  static File uploadFile;
  static bool authorized;
  HTTPUpload &upload = this->upload();
  switch (upload.status) {
    case UPLOAD_FILE_START:
      if (!(authorized = this->authorized())) return;
      if (upload.filename == conf.fileName()) return;
      uploadFile = SPIFFS.open(upload.filename.startsWith(F("/")) ? upload.filename : "/" + upload.filename, "w");
      blink.setMode(smartBlink::mode_flash4);
      return;
    case UPLOAD_FILE_WRITE:
      if (uploadFile) uploadFile.write(upload.buf, upload.currentSize);
      return;
    case UPLOAD_FILE_ABORTED:
    case UPLOAD_FILE_END:
      this->sendServerHeaders();
      if (uploadFile) {
        blink.previous();
        uploadFile.close();
        if (upload.status != UPLOAD_FILE_END) this->send(400);
        else this->api_spiffs_list();
      } else this->send(authorized ? 500 : 401);
  }
}

/*
   Формирует список файлов, находящихся во flash памяти микроконтроллера.
   Обязательно исключайте из списка Ваши файлы конфигурации.
*/
void http::api_spiffs_list() {
  this->sendServerHeaders();
  if (this->authorized()) {
    String answer;
    FSInfo spiffs;
    SPIFFS.info(spiffs);
    Dir obj = SPIFFS.openDir(F("/"));
    while (obj.next()) {
      if (obj.fileName() == conf.fileName()) continue;
      if (answer.length()) answer += ',';
      answer += "\"" + obj.fileName().substring(1) + "\":" + String(obj.fileSize());
    }
    if (answer.length()) answer = "{" + answer + "}";
    this->send(200, headerJson, "{\"spiffs\":" + String(spiffs.totalBytes) + ",\"list\":[" + answer + "]}");
  } else this->send(401);
}

