alex01277/rs485-esp/ESP8266_WS_V4.2/webserver.h
/*
   Удаляет файл из flash памяти микроконтроллера.
   Обязательно наличие проверки на удаление файла конфигурации, в противном случае можно поменяться в лице.
*/
void http::api_spiffs_delete() {
  this->sendServerHeaders();
  if (this->authorized()) {
    if (this->hasArg(F("file"))) {
      String deleteFile = "/" + this->arg(F("file"));
      if (deleteFile != conf.fileName() and SPIFFS.exists(deleteFile)) {
        SPIFFS.remove(deleteFile);
        this->api_spiffs_list();
        return;
      }
    } this->send(500);
  } else this->send(401);
}

/*
   Формирует список с данными отображаемыми в разделе "Система" панели управления.
*/
void http::api_system_info() {
  this->sendServerHeaders();
  if (this->authorized()) {
    FSInfo spiffs;
    SPIFFS.info(spiffs);
    
    String answer;
    answer += "\"bmac\":\""           + conf.param("client_bmac") + "\",";    
    answer += "\"ip\":\""             + wifi.ip().toString() + "\",";
    answer += "\"subnet\":\""         + WiFi.subnetMask().toString() + "\",";
    answer += "\"dns1\":\""           + WiFi.dnsIP().toString() + "\",";
    answer += "\"dns2\":\""           + WiFi.dnsIP(1).toString() + "\",";
    answer += "\"gateway\":\""        + WiFi.gatewayIP().toString() + "\",";
    answer += "\"rssi\":\""           + String(WiFi.RSSI()) + " dBm\",";
    answer += "\"mac\":\""            + String(WiFi.macAddress()) + "\",";        // uint8_t (array[6])
    answer += "\"channel\":"          + String(WiFi.channel()) + ",";
    answer += "\"mode\":\""           + wifi.wifiMode() + "\",";
    answer += "\"phyMode\":\""        + wifi.wifiPhyMode() + "\",";
    answer += "\"vcc\":\""            + String(ESP.getVcc() * 0.001) + " V\",";   // uint16_t
    answer += "\"freeHeap\":"         + String(ESP.getFreeHeap()) + ",";          // uint32_t
    answer += "\"chipId\":"           + String(ESP.getChipId()) + ",";            // uint32_t
    answer += "\"sdkVersion\":\""     + String(ESP.getSdkVersion()) + "\",";      // const char *
    answer += "\"coreVersion\":\""    + ESP.getCoreVersion() + "\",";
    answer += "\"cpuFreqMHz\":\""     + String(ESP.getCpuFreqMHz()) + " MHz\",";  // uint8_t
    answer += "\"flashRealSize\":"    + String(ESP.getFlashChipRealSize()) + ","; // uint32_t
    answer += "\"flashChipId\":"      + String(ESP.getFlashChipId()) + ",";       // uint32_t
    answer += "\"flashChipSpeed\":\"" + String(int(ESP.getFlashChipSpeed() * 0.000001)) + " MHz\","; // uint32_t
    answer += "\"spiffsTotalBytes\":" + String(spiffs.totalBytes) + ",";
    answer += "\"spiffsUsedBytes\":"  + String(spiffs.usedBytes) + ",";
    answer += "\"spiffsBlockSize\":"  + String(spiffs.blockSize) + ",";
    answer += "\"spiffsPageSize\":"   + String(spiffs.pageSize) + ",";
    answer += "\"sketchVersion\":\"v2 (23.11.2019)\",";
    answer += "\"sketchSize\":"       + String(ESP.getSketchSize()) + ",";        // uint32_t
    answer += "\"sketchMD5\":\""      + ESP.getSketchMD5() + "\",";
    answer += "\"freeSketchSpace\":"  + String(ESP.getFreeSketchSpace()) + ",";   // uint32_t
    answer += "\"resetReason\":\""    + ESP.getResetReason() + "\",";
    answer += "\"resetInfo\":\""      + ESP.getResetInfo() + "\",";
    answer += "\"bootVersion\":\""    + String(ESP.getBootVersion()) + "\",";      // uint8_t
    //answer += "\"bootMode\":\""     + String(ESP.getBootMode()) + "\",";         // uint8_t
    answer += "\"millis\":"           + String(millis());
    this->send(200, headerJson, "{" + answer + "}");
  } else this->send(401);
}

/*
   Наполняет стандартную телеграмму с показаниями датчиков информацией о некоторых характеристиках микроконтроллера.
   Данные будут переданы только авторизованному пользователю.
*/
String http::api_system_info_live(String answer) {
  if (this->hasArg(F("system"))) {
    if (this->authorized()) {
      String system;
      system += "\"rssi\":\""   + String(wifi.isConnected() ? WiFi.RSSI() : 0) + " dBm\",";
      system += "\"vcc\":\""    + String(ESP.getVcc() * 0.001) + " V\",";
      system += "\"freeHeap\":" + String(ESP.getFreeHeap()) + ",";
      system += "\"millis\":"   + String(millis());
      answer += ",\"system\":{" + system + "}";
    }
  } return "{" + answer + "}";
}

/*
   Перезагружает устройство.
*/
void http::api_system_reboot() {
  this->sendServerHeaders();
  if (this->authorized()) {
    this->send(202);
    delay(2000); // задержка обязательна, иначе контроллер уйдет на перезагрузку до завершения передачи!
    ESP.restart();
  } else this->send(401);
}

/*
   Сброс настроек микроконтроллера.
   Удаляет файл конфигурации и перезагружает устройство.
*/
void http::api_system_hardReset() {
  this->sendServerHeaders();
  if (this->authorized()) {
    this->send(202);
    conf.remove();
    delay(2000); // задержка обязательна, иначе контроллер уйдет на перезагрузку до завершения передачи!
    ESP.restart();
  } else this->send(401);
}

/*
   Сканер шины i2c.
   Формирует список устройств с их статусами.
*/
void http::api_system_i2c_scaner() {
  this->sendServerHeaders();
  if (this->authorized()) {
    String answer;
    for (byte address = 1; address < 127; address++) {
      Wire.beginTransmission(address);
      byte status = Wire.endTransmission();
      if (!status or status == 4) {
        answer += answer.length() ? "," : "";
        answer += "\"" + String((address < 16) ? "0" : "") + String(address, HEX) + "\":" + (!status ? '1' : '0');
      }
    }
    this->send(200, headerJson, "{\"list\":{" + answer + "}}");
  } else this->send(401);
}

/*
   Обновление программы микроконтроллера.
*/
void http::api_system_update() { /* объеденено с обработчиком */ }
void http::api_system_update_handler() {
  static bool status;
  static bool authorized;
  HTTPUpload& upload = this->upload();
  switch (upload.status) {
    case UPLOAD_FILE_START:    
      status = false;
      if (!(authorized = this->authorized())) return;
      if (upload.filename.length() != 32 or Update.isRunning()) return;
      status = true;
      Update.begin((ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000);
      Update.setMD5(upload.filename.c_str());
      blink.setMode(smartBlink::mode_flash4);
      return;
    case UPLOAD_FILE_WRITE:
      if (status) Update.write(upload.buf, upload.currentSize);
      return;
    case UPLOAD_FILE_ABORTED:
    case UPLOAD_FILE_END:
      this->sendServerHeaders();
      if (status) {
        blink.previous();
        String answer;
        answer += "\"status\":" + String(Update.hasError() ? "false" : "true") + ',';
        answer += "\"error\":"  + String(Update.getError());
        this->send(200, headerJson, "{" + answer + "}");
        delay(2000); // задержка обязательна, иначе контроллер уйдет на перезагрузку до завершения передачи!
        if (Update.end(!Update.hasError())) ESP.restart();
      } else this->send(authorized ? 500 : 401);
  }
}

