alex01277/rs485-esp/ESP8266_WS_V4.2/webserver.h
/*
   Генерирует MD5 хэш из переданной строки.
*/
String http::md5(String str) {
  MD5Builder md5;
  md5.begin();
  md5.add(str);
  md5.calculate();
  return md5.toString();
}

/*
   Функция управляет уровнем безопасности для защиты от брутфорса пароля или cookies.
   Если вызвана без параметра, возвращает текущий статус безопасности - true если уровень приемлем и false если поднята тревога.
   В качестве параметра принимает security_t - действие которое необходимо провести с текущим уровнем:
    up   - поднять
    down - опустить
   Понижение уровня тревоги происходит автоматически с интервалом в 1 минуту.
   При изменении уровня тревоги, функция ничего не возвращает.
*/
bool http::security() { return this->securityLevel < this->securityFail ? true : false; }
void http::security(security_t action) {
  if (action and this->securityLevel < this->securityFail) this->securityLevel++;
  else if (!action and this->securityLevel > 0) this->securityLevel--;
  else return;
  cron.update("httpSecurity");
}

void sendResponse(WiFiClient* client, String response) {
  client->println(response);
#ifdef console
  console.print("sendResp: ");
  console.print(response);
 //if (SERIAL_PRINT) { Serial.print("sendResp: "); Serial.println();}
#endif  
}
String readRequest(WiFiClient* client) {

   String request = "";
   while (client->connected()) { while (client->available()) {
                               char c = client->read();
                               if ('\n' == c) {  return request;  }
                               request += c;}
                              }
   return request;
  }
void executeRequest(WiFiClient* client, String* request) {
  //float lp1,lp2;
  client->println("HTTP/1.1 200 OK");
  client->println("Content-Type: text/plain");
  client->println("Access-Control-Allow-Origin: *");
  client->println("Access-Control-Allow-Methods: GET");
  client->println();
  //lp1=dallasSensors.getTempC(sensorAddress0);
  //lp2=dallasSensors.getTempC(sensorAddress1);
  // if (lp2<0) {lp2=lp2+30;}  // shift negative value for mrtg tool
  //sendResponse(client, String(tempC0));
  //sendResponse(client, String(tempC1)); sensors.get("ds18b20_s0"));
  sendResponse(client, String(sensors.get("ds18b20_s0")));         //from 1820 - s0  CAMERA!!!
  sendResponse(client, String(sensors.get("out_temperature") ) );  //from BME280 local sensor
  //sendResponse(client, String(sensors.get("ds18b20_s1")));
}

void sendSMS(String ssRecipient,String ssMessage)
  { //delay(2000); //wait for previons meesage sended  //char linn[400];
    const int   httpPort     = 80;
    String      surl_0       = "/api/v1/send_sms/plain";
    const char* sstreamId    = "MelnikAV";
    const char* sprivateKey  = "85833124";
    String      ssSender     = "sklad-27-2";
    const char* shost        = "userarea.sms-assistent.by";
    String      url          = "https://";   
    url += shost;           url += surl_0;
    url += "?user=";        url += sstreamId;
    url += "&password=";    url += sprivateKey;
    url +="&recipient=";    url += "+375"+ssRecipient;
    url +="&message=";      url += ssMessage;
    url +="&sender=";       url += ssSender;
   #ifdef console
    console.print("Req -HI URL: "); 
    console.println(url);  // This will send the request to the server
   #endif
    //WiFiClient client;
    HTTPClient http;
  //if (http.begin(url,"6A BC 35 28 52 99 C9 F9 08 27 A0 96 27 9A F3 75 C6 1E 52 28"))  HTTPS!!!
  //if (http.begin(url,"53 1B 09 8C 56 46 CD 37 F0 0A 26 41 B4 49 CC 19 61 FD 01 F5")) { // HTTPS!!!16012020
    if (http.begin(url,"3B 32 22 49 1F 5C 27 F1 DE 38 AF 20 1A E2 8B 18 57 D3 73 5C")) {
        #ifdef console
         console.println("[HTTP] GET...\n");  
        #endif
        delay(1000);        // wait for code else may be reboot occurs
        int httpCode = http.GET();
        delay(1000);
        if (httpCode > 0) {    // HTTP header has been send and Server response header has been handled
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
            delay(500);
            String payload = http.getString();
           #ifdef console
            console.println(payload);
           #endif          
        }
      } else {
       #ifdef console        
        console.printf("[HTTP] GET... failed, error: %s\n", http.errorToString(httpCode).c_str());
       #endif        
      }
      http.end();
    } else {
         #ifdef console
          console.printf("[HTTP} Unable to connect\n");
         #endif          
    }
 // delay(2000);
 }  
#endif
